import { DeleteFilled, DeleteOutlined, EditOutlined } from "@ant-design/icons";
import { Button } from "antd";

export const dataSource = [
    { id: '1', نام: 'علی رضایی', سن: 32, آدرس: 'تهران' },
    { id: '2', نام: 'مریم محمدی', سن: 28, آدرس: 'مشهد' },
    { id: '3', نام: 'حسین احمدی', سن: 25, آدرس: 'اصفهان' },
    { id: '4', نام: 'فاطمه کریمی', سن: 30, آدرس: 'شیراز' },
    { id: '5', نام: 'سعید حسینی', سن: 27, آدرس: 'تبریز' },
    { id: '6', نام: 'زهرا نادری', سن: 24, آدرس: 'قم' },
    { id: '7', نام: 'امیر کاظمی', سن: 29, آدرس: 'کرج' },
    { id: '8', نام: 'نرگس سهرابی', سن: 31, آدرس: 'اهواز' },
    { id: '9', نام: 'رضا شریفی', سن: 26, آدرس: 'زنجان' },
    { id: '10', نام: 'لیلا حسینی', سن: 33, آدرس: 'اراک' },
    { id: '11', نام: 'علی اکبری', سن: 35, آدرس: 'مشهد' },
    { id: '12', نام: 'مهدی طاهری', سن: 22, آدرس: 'تهران' },
    { id: '13', نام: 'سارا غلامی', سن: 29, آدرس: 'شیراز' },
    { id: '14', نام: 'حمیدرضا جلیلی', سن: 34, آدرس: 'تبریز' },
    { id: '15', نام: 'پریسا نیکو', سن: 26, آدرس: 'اصفهان' },
    { id: '16', نام: 'حسین امینی', سن: 30, آدرس: 'کرج' },
    { id: '17', نام: 'مینا نجفی', سن: 28, آدرس: 'مشهد' },
    { id: '18', نام: 'جواد سلیمانی', سن: 27, آدرس: 'قم' },
    { id: '19', نام: 'فرزانه رستمی', سن: 25, آدرس: 'اهواز' },
    { id: '20', نام: 'کامران رجبی', سن: 32, آدرس: 'زنجان' },
    { id: '21', نام: 'سمیرا قاسمی', سن: 24, آدرس: 'اراک' },
    { id: '22', نام: 'علی ملکی', سن: 29, آدرس: 'تهران' },
    { id: '23', نام: 'نرگس بخشی', سن: 31, آدرس: 'مشهد' },
    { id: '24', نام: 'رضا حسینی', سن: 22, آدرس: 'شیراز' },
    { id: '25', نام: 'مهدی زارعی', سن: 35, آدرس: 'تبریز' },
    { id: '26', نام: 'فاطمه حیدری', سن: 26, آدرس: 'اصفهان' },
    { id: '27', نام: 'علی اکبر زاده', سن: 30, آدرس: 'کرج' },
    { id: '28', نام: 'سارا محمدی', سن: 28, آدرس: 'مشهد' },
    { id: '29', نام: 'حمیدرضا احمدی', سن: 27, آدرس: 'قم' },
    { id: '30', نام: 'پریسا نیکو', سن: 25, آدرس: 'اهواز' },
    { id: '31', نام: 'جواد سلیمی', سن: 32, آدرس: 'زنجان' },
    { id: '32', نام: 'سمیه حسینی', سن: 24, آدرس: 'اراک' },
    { id: '33', نام: 'علی شفیعی', سن: 29, آدرس: 'تهران' },
    { id: '34', نام: 'مینا قاسمی', سن: 31, آدرس: 'مشهد' },
    { id: '35', نام: 'رضا صادقی', سن: 22, آدرس: 'شیراز' },
    { id: '36', نام: 'حسین نیکو', سن: 35, آدرس: 'تبریز' },
    { id: '37', نام: 'فاطمه یوسفی', سن: 26, آدرس: 'اصفهان' },
    { id: '38', نام: 'علی سلیمی', سن: 30, آدرس: 'کرج' },
    { id: '39', نام: 'نرگس احمدی', سن: 28, آدرس: 'مشهد' },
    { id: '40', نام: 'رضا زارعی', سن: 27, آدرس: 'قم' },
    { id: '41', نام: 'فرزانه رستمی', سن: 25, آدرس: 'اهواز' },
    { id: '42', نام: 'کامران رجبی', سن: 32, آدرس: 'زنجان' },
    { id: '43', نام: 'سمیرا قاسمی', سن: 24, آدرس: 'اراک' },
    { id: '44', نام: 'علی ملکی', سن: 29, آدرس: 'تهران' },
    { id: '45', نام: 'نرگس بخشی', سن: 31, آدرس: 'مشهد' },
    { id: '46', نام: 'رضا حسینی', سن: 22, آدرس: 'شیراز' },
    { id: '47', نام: 'مهدی زارعی', سن: 35, آدرس: 'تبریز' },
    { id: '48', نام: 'فاطمه حیدری', سن: 26, آدرس: 'اصفهان' },
    { id: '49', نام: 'علی اکبر زاده', سن: 30, آدرس: 'کرج' },
    { id: '50', نام: 'سارا محمدی', سن: 28, آدرس: 'مشهد' },
    { id: '51', نام: 'حمیدرضا احمدی', سن: 27, آدرس: 'قم' },
    { id: '52', نام: 'پریسا نیکو', سن: 25, آدرس: 'اهواز' },
    { id: '53', نام: 'جواد سلیمی', سن: 32, آدرس: 'زنجان' },
    { id: '54', نام: 'سمیه حسینی', سن: 24, آدرس: 'اراک' },
    { id: '55', نام: 'علی شفیعی', سن: 29, آدرس: 'تهران' },
    { id: '56', نام: 'مینا قاسمی', سن: 31, آدرس: 'مشهد' },
    { id: '57', نام: 'رضا صادقی', سن: 22, آدرس: 'شیراز' },
    { id: '58', نام: 'حسین نیکو', سن: 35, آدرس: 'تبریز' },
    { id: '59', نام: 'فاطمه یوسفی', سن: 26, آدرس: 'اصفهان' },
    { id: '60', نام: 'علی سلیمی', سن: 30, آدرس: 'کرج' },
    { id: '61', نام: 'نرگس احمدی', سن: 28, آدرس: 'مشهد' },
    { id: '62', نام: 'رضا زارعی', سن: 27, آدرس: 'قم' },
    { id: '63', نام: 'فرزانه رستمی', سن: 25, آدرس: 'اهواز' },
    { id: '64', نام: 'کامران رجبی', سن: 32, آدرس: 'زنجان' },
    { id: '65', نام: 'سمیرا قاسمی', سن: 24, آدرس: 'اراک' },
    { id: '66', نام: 'علی ملکی', سن: 29, آدرس: 'تهران' },
    { id: '67', نام: 'نرگس بخشی', سن: 31, آدرس: 'مشهد' },
    { id: '68', نام: 'رضا حسینی', سن: 22, آدرس: 'شیراز' },
    { id: '69', نام: 'مهدی زارعی', سن: 35, آدرس: 'تبریز' },
    { id: '70', نام: 'فاطمه حیدری', سن: 26, آدرس: 'اصفهان' },
    { id: '71', نام: 'علی اکبر زاده', سن: 30, آدرس: 'کرج' },
    { id: '72', نام: 'سارا محمدی', سن: 28, آدرس: 'مشهد' },
    { id: '73', نام: 'حمیدرضا احمدی', سن: 27, آدرس: 'قم' },
    { id: '74', نام: 'پریسا نیکو', سن: 25, آدرس: 'اهواز' },
    { id: '75', نام: 'جواد سلیمی', سن: 32, آدرس: 'زنجان' },
    { id: '76', نام: 'سمیه حسینی', سن: 24, آدرس: 'اراک' },
    { id: '77', نام: 'علی شفیعی', سن: 29, آدرس: 'تهران' },
    { id: '78', نام: 'مینا قاسمی', سن: 31, آدرس: 'مشهد' },
    { id: '79', نام: 'رضا صادقی', سن: 22, آدرس: 'شیراز' },
    { id: '80', نام: 'حسین نیکو', سن: 35, آدرس: 'تبریز' },
    { id: '81', نام: 'فاطمه یوسفی', سن: 26, آدرس: 'اصفهان' },
    { id: '82', نام: 'علی سلیمی', سن: 30, آدرس: 'کرج' },
    { id: '83', نام: 'نرگس احمدی', سن: 28, آدرس: 'مشهد' },
    { id: '84', نام: 'رضا زارعی', سن: 27, آدرس: 'قم' },
    { id: '85', نام: 'فرزانه رستمی', سن: 25, آدرس: 'اهواز' },
    { id: '86', نام: 'کامران رجبی', سن: 32, آدرس: 'زنجان' },
    { id: '87', نام: 'سمیرا قاسمی', سن: 24, آدرس: 'اراک' },
    { id: '88', نام: 'علی ملکی', سن: 29, آدرس: 'تهران' },
    { id: '89', نام: 'نرگس بخشی', سن: 31, آدرس: 'مشهد' },
    { id: '90', نام: 'رضا حسینی', سن: 22, آدرس: 'شیراز' },
    { id: '91', نام: 'مهدی زارعی', سن: 35, آدرس: 'تبریز' },
    { id: '92', نام: 'فاطمه حیدری', سن: 26, آدرس: 'اصفهان' },
    { id: '93', نام: 'علی اکبر زاده', سن: 30, آدرس: 'کرج' },
    { id: '94', نام: 'سارا محمدی', سن: 28, آدرس: 'مشهد' },
    { id: '95', نام: 'حمیدرضا احمدی', سن: 27, آدرس: 'قم' },
    { id: '96', نام: 'پریسا نیکو', سن: 25, آدرس: 'اهواز' },
    { id: '97', نام: 'جواد سلیمی', سن: 32, آدرس: 'زنجان' },
    { id: '98', نام: 'سمیه حسینی', سن: 24, آدرس: 'اراک' },
    { id: '99', نام: 'علی شفیعی', سن: 29, آدرس: 'تهران' },
    { id: '100', نام: 'مینا قاسمی', سن: 31, آدرس: 'مشهد' },
];

export const columns = (handleEditUser, handleDeleteUser) => [
    {
        title: 'نام',
        dataIndex: 'نام',
        key: 'نام',
    },
    {
        title: 'سن',
        dataIndex: 'سن',
        key: 'سن',
    },
    // {
    //     title: 'وضعیت',
    //     dataIndex: 'وضعیت',
    //     key: 'وضعیت',
    //     render: (_, record) => (
    //         if ("وضعیت" === "فعال"){

    //         }
    //     )
    // },
    {
        title: 'آدرس',
        dataIndex: 'آدرس',
        key: 'آدرس',
    },
    {
        title: "عملیات",
        key: "actions",
        render: (_, record) => (
            <div className="flex gap-2">
                <Button
                    type="text"
                    title="ویرایش"
                    icon={<EditOutlined className="text-green-600" />}
                    onClick={() => handleEditUser(record)}
                />
                <Button
                    type="text"
                    title="حذف"
                    icon={<DeleteOutlined className="text-red-600" />}
                    onClick={() => handleDeleteUser(record)}
                />
            </div>
        ),
    },
];